Revit 2027 API
ParameterTypeId.AnalyticalModelTopExtensionMethod Property
 "Top Extension Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelTopExtensionMethod { get; }
Public Shared ReadOnly Property AnalyticalModelTopExtensionMethod As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelTopExtensionMethod {
	ForgeTypeId^ get ();
}
static member AnalyticalModelTopExtensionMethod : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace